In [74]:
import pandas as pd

In [83]:
df = pd.read_csv('employee_data.csv', index_col=0)

In [84]:
df.head()

   Empno    Ename Job  Deptno
0      1  Nirajan  ML       2

In [85]:
df.shape

(1, 4)

In [86]:
new_row = {'Empno': 1, 'Ename': 'Nirajan', 'Job': 'ML', 'Deptno': 2}

new_data = pd.DataFrame([new_row])

# Concatenate the single-row DataFrame with the empty DataFrame
df = pd.concat([df, new_data], ignore_index=True)

In [87]:
df.head()

   Empno    Ename Job  Deptno
0      1  Nirajan  ML       2
1      1  Nirajan  ML       2

In [88]:
df.to_csv('employee_data.csv')

In [82]:
df.head()

  Empno    Ename Job Deptno
0     1  Nirajan  ML      2